Revit 2027 API
UpdaterId.GetGUID Method
 GUID value of the UpdaterId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetGUID()
Public Function GetGUID As Guid
public:
Guid GetGUID()
member GetGUID : unit -> Guid
Return Value
Guid
See Also
Reference
UpdaterId Class
Autodesk.Revit.DB Namespace